In [2]:
!command conda env list
!command pip install pandas

# conda environments:
#
base                     /usr/local/Caskroom/miniconda/base
automation            *  /usr/local/Caskroom/miniconda/base/envs/automation
chaos                    /usr/local/Caskroom/miniconda/base/envs/chaos
fastapi                  /usr/local/Caskroom/miniconda/base/envs/fastapi
gdrive                   /usr/local/Caskroom/miniconda/base/envs/gdrive
google-api               /usr/local/Caskroom/miniconda/base/envs/google-api
packaging                /usr/local/Caskroom/miniconda/base/envs/packaging
pyapi_client             /usr/local/Caskroom/miniconda/base/envs/pyapi_client

Collecting pandas
  Downloading pandas-1.3.4-cp39-cp39-macosx_10_9_x86_64.whl (11.6 MB)
     |████████████████████████████████| 11.6 MB 11.0 MB/s eta 0:00:01
Requirement already satisfied: pytz>=2017.3 in /usr/local/Caskroom/miniconda/base/envs/automation/lib/python3.9/site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/Caskroom/miniconda/base/envs/automation/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in /usr/local/Caskroom/miniconda/base/envs/automation/lib/python3.9/site-packages (from pandas) (1.21.4)
Requirement already satisfied: six>=1.5 in /usr/local/Caskroom/miniconda/base/envs/automation/lib/python3.9/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Installing collected packages: pandas
Successfully installed pandas-1.3.4

In [4]:
import pandas as pd

s1 = pd.Series([10,20,30,40,50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
s1.values

array([10, 20, 30, 40, 50])

In [8]:
import numpy as np
    
index_data = ['2021-02-27','2021-02-28','2021-03-01','2021-03-02']
data = [3500, 3579, np.nan, 3782]

s2 = pd.Series(data, index=index_data)
s2

2021-02-27    3500.0
2021-02-28    3579.0
2021-03-01       NaN
2021-03-02    3782.0
dtype: float64

In [9]:
# dict로 Series 데이터 생성
s3 = pd.Series({'국어':100, '영어':95, '수학':90})
s3

국어    100
영어     95
수학     90
dtype: int64

In [12]:
# 날짜 데이터 범위로 입력하기
# s = pd.date_range(start = None, end = None, periods = None, freq = 'D')
index_data = pd.date_range(start='2021-02-27',end='2021-03-02')
data = [3500, 3579, np.nan, 3782]

s2 = pd.Series(data, index=index_data)
s2

2021-02-27    3500.0
2021-02-28    3579.0
2021-03-01       NaN
2021-03-02    3782.0
Freq: D, dtype: float64

In [13]:
# date_range()를 이용해 날짜를 생성하는 예제
# 시작일 ~ 종료일 이틀 주기로 날짜 생성
pd.date_range(start='2020-01-01', end='2020-03-01', freq='2D')

DatetimeIndex(['2020-01-01', '2020-01-03', '2020-01-05', '2020-01-07',
               '2020-01-09', '2020-01-11', '2020-01-13', '2020-01-15',
               '2020-01-17', '2020-01-19', '2020-01-21', '2020-01-23',
               '2020-01-25', '2020-01-27', '2020-01-29', '2020-01-31',
               '2020-02-02', '2020-02-04', '2020-02-06', '2020-02-08',
               '2020-02-10', '2020-02-12', '2020-02-14', '2020-02-16',
               '2020-02-18', '2020-02-20', '2020-02-22', '2020-02-24',
               '2020-02-26', '2020-02-28', '2020-03-01'],
              dtype='datetime64[ns]', freq='2D')

In [14]:
# 시작일 기준으로 설정한 기간동안 생성
pd.date_range(start='2021-01-03', periods=12)

DatetimeIndex(['2021-01-03', '2021-01-04', '2021-01-05', '2021-01-06',
               '2021-01-07', '2021-01-08', '2021-01-09', '2021-01-10',
               '2021-01-11', '2021-01-12', '2021-01-13', '2021-01-14'],
              dtype='datetime64[ns]', freq='D')

In [15]:
# 시작일 기준으로 설정한 기간동안 업무일(freq='B') 기준으로 날짜 생성
pd.date_range(start='2021-01-01', periods=12, freq='B')

DatetimeIndex(['2021-01-01', '2021-01-04', '2021-01-05', '2021-01-06',
               '2021-01-07', '2021-01-08', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-18'],
              dtype='datetime64[ns]', freq='B')

In [17]:
# 시작일과 시각 기준으로 설정한 기간동안 날짜 및 시각 생성(freq='30min')
pd.date_range(start='2021-01-01 10:00', periods=5, freq='30min')

DatetimeIndex(['2021-01-01 10:00:00', '2021-01-01 10:30:00',
               '2021-01-01 11:00:00', '2021-01-01 11:30:00',
               '2021-01-01 12:00:00'],
              dtype='datetime64[ns]', freq='30T')

In [18]:
# Series 데이터 재배열
s4 = pd.Series({'B': 4.0, 'A': 5.0, 'D':2.0, 'C': 3.0})
s4

B    4.0
A    5.0
D    2.0
C    3.0
dtype: float64

In [20]:
s4.reindex(['A','B','C','D'])

A    5.0
B    4.0
C    3.0
D    2.0
dtype: float64

In [21]:
### 데이터프레임 사용
import pandas as pd

data = [[1,2,3],[4,5,6],[7,8,9]]
df = pd.DataFrame(data)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [22]:
## numpy, dataframe 사용
import numpy as np
import pandas as pd

data = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])
index_data = pd.date_range('2021-01-01', periods=4)
columns_data = ['A','B','C']

pd.DataFrame(data, index=index_data, columns=columns_data)

             A   B   C
2021-01-01   1   2   3
2021-01-02   4   5   6
2021-01-03   7   8   9
2021-01-04  10  11  12

In [23]:
## dict를 이용한 데이터 생성
dict_data = {'연도': [2017,2017,2018,2018,2019,2019],
            '지사': ['한국','미국','한국','미국','한국','미국'],
            '고객수': [200, np.nan, 250, 450, 300, 500]}

df = pd.DataFrame(dict_data)
df

     연도  지사    고객수
0  2017  한국  200.0
1  2017  미국    NaN
2  2018  한국  250.0
3  2018  미국  450.0
4  2019  한국  300.0
5  2019  미국  500.0

In [24]:
# DataFrame 데이터에서 index, columns, values 확인
df.index

RangeIndex(start=0, stop=6, step=1)

In [25]:
df.columns

Index(['연도', '지사', '고객수'], dtype='object')

In [26]:
df.values

array([[2017, '한국', 200.0],
       [2017, '미국', nan],
       [2018, '한국', 250.0],
       [2018, '미국', 450.0],
       [2019, '한국', 300.0],
       [2019, '미국', 500.0]], dtype=object)

In [27]:
# 특정 열을 이용해 index 변경
df1 = df.set_index("연도")
df1

      지사    고객수
연도
2017  한국  200.0
2017  미국    NaN
2018  한국  250.0
2018  미국  450.0
2019  한국  300.0
2019  미국  500.0

In [48]:
# 재배열
dict_data = {'A': [10,20,30,40,50,60],
            'B': [0.1,0.2,0.3,0.4,0.5,0.6],
            'C': [100,200,300,400,500,600]}
df2 = pd.DataFrame(dict_data)
df2

    A    B    C
0  10  0.1  100
1  20  0.2  200
2  30  0.3  300
3  40  0.4  400
4  50  0.5  500
5  60  0.6  600

In [49]:
df2.reindex([4,2,5,3,1])

    A    B    C
4  50  0.5  500
2  30  0.3  300
5  60  0.6  600
3  40  0.4  400
1  20  0.2  200

In [50]:
df2.reindex(columns=['B','C','A'])

     B    C   A
0  0.1  100  10
1  0.2  200  20
2  0.3  300  30
3  0.4  400  40
4  0.5  500  50
5  0.6  600  60

In [64]:
%%writefile /Users/hipbone/study/automation/data/korea_rain1.csv
연도,봄,여름,가을,겨울
2014,215.9,599.8,293.1,76.9
2015,123.9,544.8,666.1,76.9
2016,456.9,333.8,633.1,76.9
2017,777.9,222.8,344.1,76.9
2018,888.9,111.8,123.1,76.9

Writing /Users/hipbone/study/automation/data/korea_rain1.csv

In [68]:
df = pd.read_csv('data/korea_rain1.csv',encoding = 'utf-8')
df

     연도      봄     여름     가을    겨울
0  2014  215.9  599.8  293.1  76.9
1  2015  123.9  544.8  666.1  76.9
2  2016  456.9  333.8  633.1  76.9
3  2017  777.9  222.8  344.1  76.9
4  2018  888.9  111.8  123.1  76.9

In [69]:
df = pd.read_csv('data/korea_rain1.csv', index_col = '연도')
df

          봄     여름     가을    겨울
연도
2014  215.9  599.8  293.1  76.9
2015  123.9  544.8  666.1  76.9
2016  456.9  333.8  633.1  76.9
2017  777.9  222.8  344.1  76.9
2018  888.9  111.8  123.1  76.9

In [72]:
df = pd.read_csv('data/korea_rain1_space.csv', sep=" ", encoding = 'utf-8')
df

     연도      봄     여름     가을    겨울
0  2014  215.9  599.8  293.1  76.9
1  2015  123.9  544.8  666.1  76.9
2  2016  456.9  333.8  633.1  76.9
3  2017  777.9  222.8  344.1  76.9
4  2018  888.9  111.8  123.1  76.9

In [74]:
df = pd.read_csv('data/korea_rain1_tab.txt', sep="\t", encoding = 'utf-8')
df

     연도      봄     여름     가을    겨울
0  2014  215.9  599.8  293.1  76.9
1  2015  123.9  544.8  666.1  76.9
2  2016  456.9  333.8  633.1  76.9
3  2017  777.9  222.8  344.1  76.9
4  2018  888.9  111.8  123.1  76.9

In [75]:
df2 = pd.read_csv('data/korea_rain2.csv')
df2

   2014  215.9  599.8  293.1  76.9
0  2015  123.9  544.8  666.1  76.9
1  2016  456.9  333.8  633.1  76.9
2  2017  777.9  222.8  344.1  76.9
3  2018  888.9  111.8  123.1  76.9

In [76]:
# columns 자동 지정
df2 = pd.read_csv('data/korea_rain2.csv',header=None)
df2

      0      1      2      3     4
0  2014  215.9  599.8  293.1  76.9
1  2015  123.9  544.8  666.1  76.9
2  2016  456.9  333.8  633.1  76.9
3  2017  777.9  222.8  344.1  76.9
4  2018  888.9  111.8  123.1  76.9

In [77]:
# columns 명시적 지정
names_list = ["Year", "Spring", "Summer", "Fall", "Winter"]

df2 = pd.read_csv('data/korea_rain2.csv', names=names_list)
df2

   Year  Spring  Summer   Fall  Winter
0  2014   215.9   599.8  293.1    76.9
1  2015   123.9   544.8  666.1    76.9
2  2016   456.9   333.8  633.1    76.9
3  2017   777.9   222.8  344.1    76.9
4  2018   888.9   111.8  123.1    76.9

In [82]:
# CSV 파일을 읽어 DataFrame 데이터 생성(header와 names 옵션 지정)

names_list = ["연도_new", "봄_new", "여름_new", "가을_new", "겨울_new"]
df2 = pd.read_csv('data/korea_rain1.csv',header=0, names=names_list)
df2

   연도_new  봄_new  여름_new  가을_new  겨울_new
0    2014  215.9   599.8   293.1    76.9
1    2015  123.9   544.8   666.1    76.9
2    2016  456.9   333.8   633.1    76.9
3    2017  777.9   222.8   344.1    76.9
4    2018  888.9   111.8   123.1    76.9